In [41]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [3]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [5]:
df[['name','age','state']]  #takes first three comumns

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [8]:
df.loc[2:4,{'name','age'}]  #grabs 2nd through 4th row

   age   name
2   22  peter
3   19   jeff
4   45   bill

In [9]:
df.iloc[:2]   #grabs firwst two rows

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [11]:
df.iloc[-2:]  #last two rows

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [13]:
#Select first column without specifiying the name of column

df.iloc[:,0]

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [15]:
df.loc[:,['age','state']]  #age and state

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [16]:
#second row in DF
df.iloc[1]

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

In [17]:
#peoples whose "age" is greater then 30
df[df['age']>30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [18]:
df[df.age>30]  #same as above

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [19]:
df[df.num_pets>df.num_children]  #select people with more pets then children

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [30]:
##Older then 40 and owns pets
df[(df.age > 40) & (df.num_pets>0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [42]:
df.drop(["age","num_children"],axis=1)
#drop number of children and age

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [43]:
#What is the average age, number of pets, and children
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000